/*Гигантский робозомби Ужасный Двубитный нападает на друзей.
Его разбудили звуки ультраметалла! Нужно перехватить его управление, иначе друзьям конец.

Создай ему конструктор без параметров и в нем замени миссию на "быстрые и комфортные перевозки".

Требования:
Нельзя изменять объявление переменной mission.
В классе TerribleTwoBit должен быть один конструктор.
В конструкторе полю mission нужно установить значение "быстрые и комфортные перевозки".*/

package javarush.test1002_2;

public class Solution {

    public static void main(String[] args) {
       TerribleTwoBit terribleTwoBit =  new TerribleTwoBit();
    }
}